app/controllers/attenders_controller.rb

SELECT * FROM `attenders`
---
  def index
    @attenders = Attender.all

SELECT * FROM `attenders` WHERE (`attenders`.`id` = 1)
---
  def show
    @attender = Attender.find(params[:id])

SELECT * FROM `attenders` WHERE (`attenders`.`id` = 1)
---
  def edit
    @attender = Attender.find(params[:id])

INSERT INTO `attenders` (`name`, `meeting_id`, `created_at`, `crypted_password`, `updated_at`, `email`) VALUES('Alessandro Pira', NULL, '2010-03-09 16:29:43', '$2a$10$Bh42guAfnj1NGwKM4I1go.XuoKwRljnfbwihZGDUHttgL9pqEMpZ.', '2010-03-09 16:29:43', 'apira@kion.it')
---
  def create
    @attender = Attender.new(params[:attender])

    respond_to do |format|
      if @attender.save

SELECT * FROM `attenders` WHERE (`attenders`.`id` = 1)
UPDATE `attenders` SET `updated_at` = '2010-03-09 16:23:56', `crypted_password` = '$2a$10$G8AHA9LcBrFOU3qXmatNX.ql7gqlGVZVHN02oUQqsEy5FlE2AmLQC' WHERE `id` = 1
---
  def update
    @attender = Attender.find(params[:id])

    respond_to do |format|
      if @attender.update_attributes(params[:attender])

SELECT * FROM `attenders` WHERE (`attenders`.`id` = 5)
DELETE FROM `attenders` WHERE `id` = 5
---
  def destroy
    @attender = Attender.find(params[:id])
    @attender.destroy