app/controllers/meeting_controller.rb

SELECT * FROM `meetings`
---
  def index
   @meetings = Meeting.all

SELECT * FROM `meetings` WHERE (`meetings`.`id` = 1)
---
  def show
   @model = Meeting.find(params[:id])

SELECT * FROM "meetings" WHERE ("meetings"."id" = 1)
---
  def add_to_cart
    meeting = Meeting.find(params[:id])