app/controllers/meetings_controller.rb

SELECT * FROM `meetings`
---
  def index
   @meetings = Meeting.all

SELECT * FROM `meetings` WHERE (`meetings`.`id` = 1)
---
  def show
    @model = Meeting.find(params[:id])

SELECT * FROM `meetings` WHERE (`meetings`.`id` = 1)
---
  def edit
    @meeting = Meeting.find(params[:id])

SELECT * FROM `meetings` WHERE (`meetings`.`id` = 1)
---
  def update
    @meeting = Meeting.find(params[:id])

INSERT INTO `meetings` (`end_time`, `created_at`, `title`, `body`, `image_url`, `updated_at`, `organizator`, `date`, `start_time`) VALUES(NULL, '2010-03-12 15:46:08', 'Ruby, il miglior amico del programmatore', 'Introduzione al linguaggio', 'http://linuxpedia.netsons.org/images/f/f1/Ruby_logo.png', '2010-03-12 15:46:08', NULL, NULL, NULL)
---
  def create
    @meeting = Meeting.new(params[:meeting])

    respond_to do |format|
      if @meeting.save