app/controllers/participations_controller.rb

SELECT * FROM `participations`
---
  def index
    @participations = Participation.all

SELECT * FROM `attenders`
---
  def new
    @participation = Participation.new
    @all_attenders = Attender.all