app/controllers/welcome_controller.rb

SELECT * FROM `meetings`
---
  def index
    @meetings = Meeting.all